#include <iostream>

using namespace std;

int main() {
	setlocale(LC_ALL, "Russian");

	string numbers[31] = { "десять", "одиннадцать", "двенадцать", "тринадцать", "четырнадцать", "пятнадцать", "шестнадцать",
		"семнадцать", "восемнадцать", "девятнадцать", "двадцать", "двадцать одно", "двадцать два", "двадцать три",
		"двадцать четыре", "двадцать пять", "двадцать шесть", "двадцать семь", "двадцать восемь", "двадцать девять",
		"тридцать", "тридцать одно", "тридцать два", "тридцать три", "тридцать четыре", "тридцать пять", "тридцать шесть",
		"тридцать семь" , "тридцать восемь", "тридцать девять" , "сорок"
	};

	string study = "учебных";
	string task = "заданий";
	int num;

	cout << "Enter the number of task: ";
	cin >> num;

	if (num > 20 && num % 10 < 5 && num % 10 > 0) {
		if (num % 10 == 1) {
			study = "учебное";
			task = "задание";
		}
		else task = "задания";
	}

	cout << numbers[num - 10] << " " << study << " " << task << endl;

	system("pause");
	return 0;
}
