#include <iostream>

using namespace std;

int main() {
	setlocale(LC_ALL, "Russian");

	string dozen[9] = { "десять", "двадцать", "тридцать", "сорок", "пятьдесят", "шестьдесят", "семьдесят", "восемьдесят", "девяносто" };
	string hundreds[9] = { "сто", "двести", "триста", "четыреста", "пятьсот", "шестьсот", "семьсот", "восемсот", "девятьсот" };
	string ones[9] = { "один", "два", "три", "четыре", "пять", "шесть", "семь", "восемь", "девять" };
	string one_dozen[9] = { "одиннадцать", "двенадцать", "тринадцать", "четырнадцать", "пятнадцать", "шестнадцать",
		"семнадцать", "восемнадцать", "девятнадцать" };

	int a, b, c;

	cout << "Enter the number: ";
	cin >> a;

	cout << hundreds[a / 100 - 1] << " ";
	if (a % 100 > 10 && a % 100 < 20) {
		cout << one_dozen[a % 10 - 1] << endl;
	}
	else if(a%100 > 0) {
		cout << dozen[a / 10 % 10 - 1] << " ";
		if (a % 10 > 0)
			cout << ones[a % 10 - 1];
	}

	cout << endl;

	system("pause");
	return 0;
}